research/chamber-model/openfoam/chamber42_2d/0.orig/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];  internalField uniform (0 0 0);
boundaryField
{
    chip { type noSlip; }   condenser { type noSlip; }
    floor { type noSlip; }  walls { type noSlip; }
    front { type empty; }   back { type empty; }
}
