research/chamber-model/openfoam/chamber42_2d/0.orig/alpha.water
FoamFile { version 2.0; format ascii; class volScalarField; object alpha.water; }
dimensions [0 0 0 0 0 0 0];  internalField uniform 0;
boundaryField
{
    chip { type zeroGradient; }   condenser { type zeroGradient; }
    floor { type zeroGradient; }  walls { type zeroGradient; }
    front { type empty; }   back { type empty; }
}
