research/chamber-model/openfoam/chamber42_2d/0.orig/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];  internalField uniform 1e5;
boundaryField
{
    chip { type calculated; value uniform 1e5; }   condenser { type calculated; value uniform 1e5; }
    floor { type calculated; value uniform 1e5; }  walls { type calculated; value uniform 1e5; }
    front { type empty; }   back { type empty; }
}
