research/chamber-model/openfoam/chamber42_2d/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers {
 "rho.*" { solver PCG; preconditioner DIC; tolerance 1e-8; relTol 0; }
 "alpha.water.*" { nAlphaCorr 2; nAlphaSubCycles 1; cAlpha 1; MULESCorr yes; nLimiterIter 5;
   solver smoothSolver; smoother symGaussSeidel; tolerance 1e-9; relTol 0; }
 "pcorr.*" { solver PCG; preconditioner DIC; tolerance 1e-6; relTol 0; }
 p_rgh { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0.01; }
 p_rghFinal { $p_rgh; relTol 0; }
 T { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0; }
 TFinal { $T; relTol 0; }
 U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-7; relTol 0; }
 UFinal { $U; relTol 0; }
}
PIMPLE { momentumPredictor no; nOuterCorrectors 1; nCorrectors 2; nNonOrthogonalCorrectors 0; pRefCell 0; pRefValue 1e5; }
